In [1]:
%load_ext sql
%sql sqlite://

'Connected: @None'

In [2]:
%%sql 

CREATE TABLE employee(enum INT,
                      firstname varchar(50) NOT NULL,
                      lastname varchar(50) NOT NULL,
                      bdate DATE NOT NULL,
                      locality varchar(50) NOT NULL,
                      salary NUMERIC(8,2),                      
                      phone VARCHAR(50) NOT NULL,
                      deptnum INT NOT NULL,
                      super_enum INT,
                      PRIMARY KEY(enum),
                      FOREIGN KEY(deptnum) REFERENCES department(dnum),
                      FOREIGN KEY(super_enum ) REFERENCES employee(enum));

INSERT INTO employee VALUES(88,'Jukka','Susi','1987-01-12','Tampere',5500.00, '044585663', 1, 89);
INSERT INTO employee VALUES(33,'Ville','Viima','1990-03-01','Nokia',4000.50, '044585664',5,88);
INSERT INTO employee VALUES(12,'Pekka','Puro','1993-01-18','Tampere',3000.00, '044585665',5,33);
INSERT INTO employee VALUES(98,'Jenni','Joki','2000-04-21','Lempäälä',4300.00, '044585666',4,88);
INSERT INTO employee VALUES(99,'Alli','Kivi','1987-01-12','Nokia',2500.00, '044585667',4,98);

SELECT * from employee;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(88, 'Jukka', 'Susi', '1987-01-12', 'Tampere', 5500, '044585663', 1, 89),
 (33, 'Ville', 'Viima', '1990-03-01', 'Nokia', 4000.5, '044585664', 5, 88),
 (12, 'Pekka', 'Puro', '1993-01-18', 'Tampere', 3000, '044585665', 5, 33),
 (98, 'Jenni', 'Joki', '2000-04-21', 'Lempäälä', 4300, '044585666', 4, 88),
 (99, 'Alli', 'Kivi', '1987-01-12', 'Nokia', 2500, '044585667', 4, 98)]

In [3]:
%%sql 

CREATE TABLE department(dnum INT,
                        dname varchar(15) NOT NULL,               
                        PRIMARY KEY(dnum),
                        UNIQUE(dname));

INSERT INTO department VALUES(1,'Headquarters');
INSERT INTO department VALUES(4,'Administration');
INSERT INTO department VALUES(5,'Research');

SELECT * from department;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Headquarters'), (4, 'Administration'), (5, 'Research')]

In [4]:
%%sql 

CREATE TABLE project(pnum INT,  
                     pname varchar(15) NOT NULL,                    
                     PRIMARY KEY(pnum),
                     UNIQUE(pname));

INSERT INTO project VALUES(1,'Product X');
INSERT INTO project VALUES(2,'Product Y');
INSERT INTO project VALUES(3,'Product Z');

SELECT * from project;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Product X'), (2, 'Product Y'), (3, 'Product Z')]

In [5]:
%%sql 

CREATE TABLE works_on(enum INT,
                      pnum INT,  
                      hours NUMERIC(5,1),                      
                      PRIMARY KEY(enum,pnum),
                      FOREIGN KEY(enum) REFERENCES employee(enum),
                      FOREIGN KEY(pnum) REFERENCES project(pnum));

INSERT INTO works_on VALUES(12,1,32.5);
INSERT INTO works_on VALUES(12,2,7.5);
INSERT INTO works_on VALUES(33,2,10.0);
INSERT INTO works_on VALUES(33,3,10.0);
INSERT INTO works_on VALUES(99,3,30.0);
INSERT INTO works_on VALUES(99,1,10.0);
INSERT INTO works_on VALUES(98,2,15.0);

SELECT * from works_on;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(12, 1, 32.5),
 (12, 2, 7.5),
 (33, 2, 10),
 (33, 3, 10),
 (99, 3, 30),
 (99, 1, 10),
 (98, 2, 15)]

In [6]:
%%sql 

UPDATE department SET dname = 'Research center' WHERE dnum = 5;

SELECT * from department;

 * sqlite://
1 rows affected.
Done.

[(1, 'Headquarters'), (4, 'Administration'), (5, 'Research center')]

In [7]:
%%sql 

UPDATE employee SET deptnum =5, super_enum = 33 WHERE enum = 99;
SELECT * from employee;

 * sqlite://
1 rows affected.
Done.

[(88, 'Jukka', 'Susi', '1987-01-12', 'Tampere', 5500, '044585663', 1, 89),
 (33, 'Ville', 'Viima', '1990-03-01', 'Nokia', 4000.5, '044585664', 5, 88),
 (12, 'Pekka', 'Puro', '1993-01-18', 'Tampere', 3000, '044585665', 5, 33),
 (98, 'Jenni', 'Joki', '2000-04-21', 'Lempäälä', 4300, '044585666', 4, 88),
 (99, 'Alli', 'Kivi', '1987-01-12', 'Nokia', 2500, '044585667', 5, 33)]

In [8]:
%%sql 

UPDATE employee SET super_enum = NULL WHERE enum = 88;
SELECT * from employee;

 * sqlite://
1 rows affected.
Done.

[(88, 'Jukka', 'Susi', '1987-01-12', 'Tampere', 5500, '044585663', 1, None),
 (33, 'Ville', 'Viima', '1990-03-01', 'Nokia', 4000.5, '044585664', 5, 88),
 (12, 'Pekka', 'Puro', '1993-01-18', 'Tampere', 3000, '044585665', 5, 33),
 (98, 'Jenni', 'Joki', '2000-04-21', 'Lempäälä', 4300, '044585666', 4, 88),
 (99, 'Alli', 'Kivi', '1987-01-12', 'Nokia', 2500, '044585667', 5, 33)]

In [9]:
%%sql 

SELECT * from employee , department;

 * sqlite://
Done.

[(88, 'Jukka', 'Susi', '1987-01-12', 'Tampere', 5500, '044585663', 1, None, 1, 'Headquarters'),
 (88, 'Jukka', 'Susi', '1987-01-12', 'Tampere', 5500, '044585663', 1, None, 4, 'Administration'),
 (88, 'Jukka', 'Susi', '1987-01-12', 'Tampere', 5500, '044585663', 1, None, 5, 'Research center'),
 (33, 'Ville', 'Viima', '1990-03-01', 'Nokia', 4000.5, '044585664', 5, 88, 1, 'Headquarters'),
 (33, 'Ville', 'Viima', '1990-03-01', 'Nokia', 4000.5, '044585664', 5, 88, 4, 'Administration'),
 (33, 'Ville', 'Viima', '1990-03-01', 'Nokia', 4000.5, '044585664', 5, 88, 5, 'Research center'),
 (12, 'Pekka', 'Puro', '1993-01-18', 'Tampere', 3000, '044585665', 5, 33, 1, 'Headquarters'),
 (12, 'Pekka', 'Puro', '1993-01-18', 'Tampere', 3000, '044585665', 5, 33, 4, 'Administration'),
 (12, 'Pekka', 'Puro', '1993-01-18', 'Tampere', 3000, '044585665', 5, 33, 5, 'Research center'),
 (98, 'Jenni', 'Joki', '2000-04-21', 'Lempäälä', 4300, '044585666', 4, 88, 1, 'Headquarters'),
 (98, 'Jenni', 'Joki', '2000-04-21', 'Lempäälä', 4300, '044585666', 4, 88, 4, 'Administration'),
 (98, 'Jenni', 'Joki', '2000-04-21', 'Lempäälä', 4300, '044585666', 4, 88, 5, 'Research center'),
 (99, 'Alli', 'Kivi', '1987-01-12', 'Nokia', 2500, '044585667', 5, 33, 1, 'Headquarters'),
 (99, 'Alli', 'Kivi', '1987-01-12', 'Nokia', 2500, '044585667', 5, 33, 4, 'Administration'),
 (99, 'Alli', 'Kivi', '1987-01-12', 'Nokia', 2500, '044585667', 5, 33, 5, 'Research center')]

In [10]:
%%sql

SELECT lastname, firstname, dname
From employee, department
WHERE deptnum = dnum;

 * sqlite://
Done.

[('Susi', 'Jukka', 'Headquarters'),
 ('Viima', 'Ville', 'Research center'),
 ('Puro', 'Pekka', 'Research center'),
 ('Joki', 'Jenni', 'Administration'),
 ('Kivi', 'Alli', 'Research center')]

In [11]:
%%sql
SELECT employee.lastname, employee.firstname, department.dname
FROM employee,department
WHERE employee.deptnum = department.dnum;

 * sqlite://
Done.

[('Susi', 'Jukka', 'Headquarters'),
 ('Viima', 'Ville', 'Research center'),
 ('Puro', 'Pekka', 'Research center'),
 ('Joki', 'Jenni', 'Administration'),
 ('Kivi', 'Alli', 'Research center')]

In [12]:
%%sql
SELECT e.lastname,e.firstname, d.dname
FROM employee AS e,department AS d
WHERE e.deptnum = d.dnum;

 * sqlite://
Done.

[('Susi', 'Jukka', 'Headquarters'),
 ('Viima', 'Ville', 'Research center'),
 ('Puro', 'Pekka', 'Research center'),
 ('Joki', 'Jenni', 'Administration'),
 ('Kivi', 'Alli', 'Research center')]

In [13]:
%%sql
SELECT lastname,firstname, locality
FROM employee ,department
WHERE deptnum = dnum AND
dname ='Administration';

 * sqlite://
Done.

[('Joki', 'Jenni', 'Lempäälä')]

In [14]:
%%sql
SELECT lastname,locality, salary 
FROM employee
WHERE locality = 'Tampere' AND salary > 3000;

 * sqlite://
Done.

[('Susi', 'Tampere', 5500)]

In [15]:
%%sql
SELECT lastname,locality, salary 
FROM employee
WHERE locality = 'Tampere' OR salary > 3000;

 * sqlite://
Done.

[('Susi', 'Tampere', 5500),
 ('Viima', 'Nokia', 4000.5),
 ('Puro', 'Tampere', 3000),
 ('Joki', 'Lempäälä', 4300)]

In [16]:
%%sql
SELECT lastname,locality, salary 
FROM employee
WHERE NOT locality = 'Tampere';

 * sqlite://
Done.

[('Viima', 'Nokia', 4000.5),
 ('Joki', 'Lempäälä', 4300),
 ('Kivi', 'Nokia', 2500)]

In [17]:
%%sql
SELECT lastname,locality, salary 
FROM employee
WHERE locality = 'Nokia' OR locality = 'Tampere' AND salary < 3000;

 * sqlite://
Done.

[('Viima', 'Nokia', 4000.5), ('Kivi', 'Nokia', 2500)]

In [18]:
%%sql
SELECT lastname,locality, salary 
FROM employee
WHERE (locality = 'Nokia' OR locality = 'Tampere') AND salary < 3000;

 * sqlite://
Done.

[('Kivi', 'Nokia', 2500)]

In [19]:
%%sql
SELECT lastname,locality, salary 
FROM employee
WHERE (locality = 'Nokia' OR 
locality = 'Tampere') AND 
salary > 3000;

 * sqlite://
Done.

[('Susi', 'Tampere', 5500), ('Viima', 'Nokia', 4000.5)]

In [20]:
%%sql
SELECT lastname,locality, salary 
FROM employee
WHERE locality = 'Nokia' OR locality = 'Tampere' AND salary > 3000;

 * sqlite://
Done.

[('Susi', 'Tampere', 5500),
 ('Viima', 'Nokia', 4000.5),
 ('Kivi', 'Nokia', 2500)]

In [21]:
%%sql
SELECT lastname,locality, salary 
FROM employee
WHERE (locality = 'Nokia' OR locality = 'Tampere') AND salary > 3000;

 * sqlite://
Done.

[('Susi', 'Tampere', 5500), ('Viima', 'Nokia', 4000.5)]

- 1.Not
- 2.AND
- 3.OR

In [22]:
%%sql
SELECT lastname,locality, salary,bdate 
FROM employee
WHERE locality = 'Tampere' OR 
salary > 3000 AND 
NOT bdate < '1960-01-01';

 * sqlite://
Done.

[('Susi', 'Tampere', 5500, '1987-01-12'),
 ('Viima', 'Nokia', 4000.5, '1990-03-01'),
 ('Puro', 'Tampere', 3000, '1993-01-18'),
 ('Joki', 'Lempäälä', 4300, '2000-04-21')]

In [23]:
%%sql
SELECT lastname,locality, salary,bdate 
FROM employee
WHERE locality = 'Tampere' OR 
salary > 3000 AND 
NOT bdate > '1960-01-01';

 * sqlite://
Done.

[('Susi', 'Tampere', 5500, '1987-01-12'),
 ('Puro', 'Tampere', 3000, '1993-01-18')]

In [24]:
%%sql
SELECT enum , lastname , firstname
FROM employee, department
WHERE deptnum =dnum AND 
(dname ='Administration' OR 
dname ='Research');

 * sqlite://
Done.

[(98, 'Joki', 'Jenni')]

In [25]:
%%sql
SELECT enum , lastname , firstname
FROM employee, department
WHERE deptnum = dnum AND dname = 'Administration' OR dname= 'Research;

SyntaxError: invalid syntax (<ipython-input-25-f0d2f53a984c>, line 1)

In [32]:
%%sql

SELECT enum , lastname , firstname, deptnum,dnum, dname
FROM employee INNER JOIN department ON deptnum = dnum;

 * sqlite://
Done.

[(88, 'Susi', 'Jukka', 1, 1, 'Headquarters'),
 (33, 'Viima', 'Ville', 5, 5, 'Research center'),
 (12, 'Puro', 'Pekka', 5, 5, 'Research center'),
 (98, 'Joki', 'Jenni', 4, 4, 'Administration'),
 (99, 'Kivi', 'Alli', 5, 5, 'Research center')]

In [33]:
%%sql

SELECT enum , lastname , firstname
FROM employee INNER JOIN department ON deptnum = dnum
WHERE dname = 'Administration' OR 
dname= 'Research';

 * sqlite://
Done.

[(98, 'Joki', 'Jenni')]